Docs/Reference/Content/images/dependencies/net8.0/d2/alloverit-dependencyinjection.d2
direction: left

aoi: AllOverIt
aoi.alloverit-dependencyinjection: AllOverIt.DependencyInjection
microsoft-extensions-dependencyinjection-abstractions_10-0-8: Microsoft.Extensions.DependencyInjection.Abstractions\nv10.0.8
microsoft-extensions-dependencyinjection-abstractions_10-0-8.style.fill: "#ADD8E6"
microsoft-extensions-dependencyinjection-abstractions_10-0-8.style.opacity: 0.8
microsoft-extensions-dependencyinjection-abstractions_10-0-8 <- aoi.alloverit-dependencyinjection
aoi.alloverit: AllOverIt
aoi.alloverit <- aoi.alloverit-dependencyinjection
aoi.alloverit-assertion: AllOverIt.Assertion
aoi.alloverit-assertion <- aoi.alloverit
